Repository: uom42/SDeleteGUI
Catalog: SDeleteGUI/Localization/Strings.*.resx
Languages: ru

# E_CMDLINE_ONLY_1_DIR_MUST_BE
source: Command line arguments ERROR!\nOnly one directory must be specifed to clean!
ru: Ошибка команной строки!\nТолько одна папка может быть передана для очистки!

# E_CMDLINE_UNKNOWN_1_ARG
source: Unknown first CommandLine argument = '{0}'!
ru: Неизвестный аргумент коммандной строки в 1 позиции = '{0}'!

# E_UNKNOWN_SOURCE
source: Unknown Source selected!
ru: Выбран неизвестный источник

# FILTER_ANY_FILE
source: Any Files|*.*
ru: Любые файлы|*.*

# L_CLEAN_TARGET
source: What to clean:
ru: Что чистим:

# L_CLEAN_TARGET_FILES
source: File(s):
ru: Файл(ы)

# L_CLEAN_TARGET_FOLDER
source: Folder and all its contents:
ru: Папка и всё её содержимое:

# L_CLEAN_TARGET_LOG_DISK_FREEE_SPACE
source: Logical drive (clean free space):
ru: Свободное место логического диска:

# L_CLEAN_TARGET_PHY_DISK
source: Empty disk without partitions:
ru: Чистый физический диск (без разделов)

# L_DISK_PARTITIONS
source: partition(s)
ru: разделов

# L_DONT_ASK_AGAIN
source: Don't ask me this again
ru: Не спрашивать больше

# L_FREE_SPACE_CLEAN_METHOD
source: Free space cleaning method:
ru: Способ очистки свободного пространства:

# L_FREE_SPACE_CLEAN_METHOD_CLEAN
source: Clean.
ru: Очистка

# L_FREE_SPACE_CLEAN_METHOD_ZERO
source: Zero (good for virtual disk optimization)
ru: Обнуление (оптимально для оптимизации виртуальных дисков)

# L_OUTPUT
source: Output:
ru: Вывод:

# L_OVERWRITE_PASS_COUNT
source: Overwrite Passes:
ru: Циклов перезаписи:

# L_SDELETE_LOCATION
source: location:
ru: расположено в:

# L_SHELL_MENU_DISPLAY_NAME
source: Clean with SDelete
ru: Очистка через SDelete

# L_SHELL_MENU_REGISTER
source: Register shell context menu
ru: Зарегистрировать в контекстном меню проводника для очистки файлов и папок.

# L_SHELL_MENU_UNREGISTER
source: Unregister shell context menu
ru: Удалить регистрацию в контекстном меню проводника для очистки файлов и папок.

# L_START
source: Start
ru: Начать

# L_STOP
source: Stop
ru: Остановить

# M_LOADING_DISK_LIST
source: Loading disk list...
ru: Загружается список дисков...

# Q_MANUAL_SEARCH_SDELETE_BINARY
source: Sysinternals '{0}' or '{1}' was not found in well-known locations! Do you want to find it manualy?
ru: Sysinternals '{0}' или '{1}' не найдена по общеизвестным расположениям! Хотите указать расположение вручную?

# Q_REGISTER_SHELL_MENU
source: Register in shell context menu for folders cleanup?
ru: Зарегистрировать в контекстном меню проводника для очистки файлов и папок?

# Q_STOP_ACTIVE_CLEANUP
source: The cleanup operation is still in progress!\n\nCancel cleaning?
ru: Операция очистки ещё не завершена!\n\nОтменить очистку?
